#+title: CCH Cálculo 4B CP44A
#+author: Guilherme Martins Machadoo

#+bibliography: ref.bib

* avaliando o resultado

Finalmente, tocamos os arquivos resultantes.

#+begin_src python :session *py* :results value
before = os.path.join(tmp, f"before.{fmt}")
wav.write(before, sample_rate, original.astype(np.int16))

after = os.path.join(tmp, f"after.{fmt}")
wav.write(after, sample_rate, filtered.astype(np.int16))

(before, after)
#+end_src

#+RESULTS:
| /tmp/yt_dlp/before.wav | /tmp/yt_dlp/after.wav |

#+begin_src shell :var dir=temp-dir :results none
mpv --no-terminal "${dir}/before.wav"
#+end_src

#+begin_src shell :var dir=temp-dir :results none
mpv --no-terminal "${dir}/after.wav"
#+end_src

